1.启动dc
dc_shell
或者使用命令
dc_shell topo  ---->这种模式是和物理库模式有关的，使用这种模式需要我们加入物理库的信息，不然会报错的。
2.读入设计
read_verilog {a.v b.v top.v} --->读入verilog的过程其实就是将文件转化成getch通用网表的形式
3.设置顶层
current_design top   ------>注意这里是写的文件名字，而不是文件
4.link一下，看设置是否有问题
link
5.检测一下语法错误,这个检测不是verilog的语法错误，而是综合中的错误，已警告的形式告知，例如我想生产触发器，一不小心代码没有写全，综合成了latch，它会给你检查出来；
check_design
6.留一个心眼，将中间结果保存下来，下次改了之后就不需要再读了，将其保存为ddc文件

